zephyrproject-rtos/zephyr/drivers/entropy/entropy_esp32.c
/*
 * Copyright (c) 2017 Intel Corporation
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#define DT_DRV_COMPAT espressif_esp32_trng

#include <string.h>
#include <soc/rtc.h>
#include <hal/rng_ll.h>
#include <esp_system.h>
#include <soc.h>
#include <esp_cpu.h>
#include <zephyr/logging/log.h>
#include <zephyr/drivers/entropy.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/arch/cpu.h>

LOG_MODULE_REGISTER(entropy, CONFIG_ENTROPY_LOG_LEVEL);

#include <hal/rtc_timer_hal.h>

#if defined CONFIG_SOC_SERIES_ESP32S3
/* If APB clock is 80 MHz, the maximum sampling frequency is around 45 KHz */
/* 45 KHz reading frequency is the maximum we have tested so far on S3 */
#define APB_CYCLE_WAIT_NUM (1778)
#elif defined CONFIG_SOC_SERIES_ESP32C5 || defined CONFIG_SOC_SERIES_ESP32C61 ||                   \
	defined CONFIG_SOC_SERIES_ESP32C6
/* On ESP32C5/C6/C61, we only read one byte at a time, then XOR the value with
 * an asynchronous timer (see code below).
 * The current value translates to a sampling frequency of around 62.5 KHz
 * for reading 8 bit samples, which is the rate at which the RNG was tested,
 * plus additional overhead for the calculation, making it slower.
 */
#define APB_CYCLE_WAIT_NUM (160 * 16)
#elif defined CONFIG_SOC_SERIES_ESP32H2
/* Same reasoning as for ESP32C6, but the CPU frequency on ESP32H2 is 96MHz instead of 160 MHz */
#define APB_CYCLE_WAIT_NUM (96 * 16)
#elif defined CONFIG_SOC_SERIES_ESP32P4
/* On ESP32P4 (ECO5+), the RNG has been tested at around 75 KHz reading
 * frequency. Scaled by the default CPU frequency, which is 360 MHz on
 * rev 1.3 and 400 MHz on rev 3.x.
 */
#if defined(CONFIG_SOC_ESP32P4_REV_1_3)
#define APB_CYCLE_WAIT_NUM (360 * 14)
#else
#define APB_CYCLE_WAIT_NUM (400 * 14)
#endif
#else
#define APB_CYCLE_WAIT_NUM (16)
#endif

static inline uint32_t entropy_esp32_get_u32(void)
{
	/* The PRNG which implements WDEV_RANDOM register gets 2 bits
	 * of extra entropy from a hardware randomness source every APB clock cycle
	 * (provided Wi-Fi or BT are enabled). To make sure entropy is not drained
	 * faster than it is added, this function needs to wait for at least 16 APB
	 * clock cycles after reading previous word. This implementation may actually
	 * wait a bit longer due to extra time spent in arithmetic and branch statements.
	 */

	uint32_t cpu_to_apb_freq_ratio = esp_clk_cpu_freq() / esp_clk_apb_freq();

	/* The cycle counter is per core. */
	static uint32_t last_ccount[CONFIG_MP_MAX_NUM_CPUS];
	uint32_t *last;
	uint32_t ccount;
	uint32_t result = 0;
	unsigned int key;

	key = arch_irq_lock();
	last = &last_ccount[arch_curr_cpu()->id];

	for (size_t i = 0; i < sizeof(result); i++) {
		do {
			ccount = esp_cpu_get_cycle_count();
			result ^= rng_ll_read_data();
		} while (ccount - *last < cpu_to_apb_freq_ratio * APB_CYCLE_WAIT_NUM);
#if SOC_RTC_TIMER_SUPPORTED
		uint32_t current_rtc_timer_counter = (rtc_timer_hal_get_cycle_count(0) & 0xFF);

		result ^= (current_rtc_timer_counter << (i * 8));
#endif
	}
	*last = ccount;
	arch_irq_unlock(key);

	return result ^ rng_ll_read_data();
}

static int entropy_esp32_get_entropy(const struct device *dev, uint8_t *buf,
				     uint16_t len)
{
	assert(buf != NULL);
	uint8_t *buf_bytes = buf;

	while (len > 0) {
		uint32_t word = entropy_esp32_get_u32();
		uint32_t to_copy = MIN(sizeof(word), len);

		memcpy(buf_bytes, &word, to_copy);
		buf_bytes += to_copy;
		len -= to_copy;
	}

	return 0;
}

static int entropy_esp32_init(const struct device *dev)
{
	const struct device *clock_dev = DEVICE_DT_GET(DT_CLOCKS_CTLR(DT_NODELABEL(trng0)));
	clock_control_subsys_t clock_subsys =
		(clock_control_subsys_t)DT_CLOCKS_CELL(DT_NODELABEL(trng0), offset);

	if (!device_is_ready(clock_dev)) {
		return -ENODEV;
	}

	clock_control_on(clock_dev, clock_subsys);

	rng_ll_enable();

	return 0;
}

static DEVICE_API(entropy, entropy_esp32_api_funcs) = {
	.get_entropy = entropy_esp32_get_entropy
};

DEVICE_DT_INST_DEFINE(0,
		    entropy_esp32_init, NULL, NULL, NULL,
		    PRE_KERNEL_1, CONFIG_ENTROPY_INIT_PRIORITY,
		    &entropy_esp32_api_funcs);
